-- Kochev Hennadii IP-91
-- PostgreSQL 12

--Задачі:

--1. Створити базу даних підприємства «LazyStudent», що займається допомогою студентам ВУЗів
--з пошуком репетиторів, проходженням практики та розмовними курсами за кордоном.



--2. Самостійно спроектувати структуру бази в залежності від наступних завдань.



--3. База даних повинна передбачати реєстрацію клієнтів через сайт компанії та збереження їх
--основної інформації. Збереженої інформації повинно бути достатньо для контактів та
--проведення поштових розсилок.



--4. Через сайт компанії може також зареєструватися репетитор, що надає освітні послуги через
--посередника «LazyStudent». Репетитор має профільні дисципліни (довільна кількість) та
--рейтинг, що визначається клієнтами, що з ним уже працювали.



--5. Компанії, з якими співпрацює підприємство, також мають зберігатися в БД.



--6. Співробітники підприємства повинні мати можливість відстежувати замовлення клієнтів та їх
--поточний статус. Передбачити можливість побудови звітності (в тому числі і фінансової) в
--розрізі періоду, клієнту, репетитора/компанії.



--7. Передбачити ролі адміністратора, рядового працівника та керівника. Відповідним чином
--розподілити права доступу.



--8. Передбачити історію видалень інформації з БД. Відповідна інформація не повинна
--відображатися на боці сайту, але керівник та адміністратор мусять мати можливість
--переглянути хто, коли і яку інформацію видалив.



--9. Передбачити систему знижок в залежності від дати реєстрації клієнта. 1 рік – 5%, 2 роки – 8%,
--3 роки – 11%, 4 роки – 15%.



--10. Передбачити можливість проведення акцій зі знижками на послуги компаній-партнерів в
--залежності від компанії та дати проведення акції.






















